Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_curiosity_pro/pic32cm_ls00_cpro_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CM5164LS00100_DFP/component/nvmctrl.h
/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 8) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE            _UINT8_(0x00)                                        /*  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_DONE_Pos              _UINT8_(0)                                           /* (NVMCTRL_INTFLAG) NVM Done Position */
#define NVMCTRL_INTFLAG_DONE_Msk              (_UINT8_(0x1) << NVMCTRL_INTFLAG_DONE_Pos)           /* (NVMCTRL_INTFLAG) NVM Done Mask */
#define NVMCTRL_INTFLAG_DONE(value)           (NVMCTRL_INTFLAG_DONE_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_DONE_Pos)) /* Assigment of value for DONE in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_PROGE_Pos             _UINT8_(1)                                           /* (NVMCTRL_INTFLAG) Programming Error Status Position */
#define NVMCTRL_INTFLAG_PROGE_Msk             (_UINT8_(0x1) << NVMCTRL_INTFLAG_PROGE_Pos)          /* (NVMCTRL_INTFLAG) Programming Error Status Mask */
#define NVMCTRL_INTFLAG_PROGE(value)          (NVMCTRL_INTFLAG_PROGE_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_PROGE_Pos)) /* Assigment of value for PROGE in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_LOCKE_Pos             _UINT8_(2)                                           /* (NVMCTRL_INTFLAG) Lock Error Status Position */
#define NVMCTRL_INTFLAG_LOCKE_Msk             (_UINT8_(0x1) << NVMCTRL_INTFLAG_LOCKE_Pos)          /* (NVMCTRL_INTFLAG) Lock Error Status Mask */
#define NVMCTRL_INTFLAG_LOCKE(value)          (NVMCTRL_INTFLAG_LOCKE_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_LOCKE_Pos)) /* Assigment of value for LOCKE in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_NVME_Pos              _UINT8_(3)                                           /* (NVMCTRL_INTFLAG) NVM Error Position */
#define NVMCTRL_INTFLAG_NVME_Msk              (_UINT8_(0x1) << NVMCTRL_INTFLAG_NVME_Pos)           /* (NVMCTRL_INTFLAG) NVM Error Mask */
#define NVMCTRL_INTFLAG_NVME(value)           (NVMCTRL_INTFLAG_NVME_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_NVME_Pos)) /* Assigment of value for NVME in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_KEYE_Pos              _UINT8_(4)                                           /* (NVMCTRL_INTFLAG) KEY Write Error Position */
#define NVMCTRL_INTFLAG_KEYE_Msk              (_UINT8_(0x1) << NVMCTRL_INTFLAG_KEYE_Pos)           /* (NVMCTRL_INTFLAG) KEY Write Error Mask */
#define NVMCTRL_INTFLAG_KEYE(value)           (NVMCTRL_INTFLAG_KEYE_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_KEYE_Pos)) /* Assigment of value for KEYE in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_NSCHK_Pos             _UINT8_(5)                                           /* (NVMCTRL_INTFLAG) NS configuration change detected Position */
#define NVMCTRL_INTFLAG_NSCHK_Msk             (_UINT8_(0x1) << NVMCTRL_INTFLAG_NSCHK_Pos)          /* (NVMCTRL_INTFLAG) NS configuration change detected Mask */
#define NVMCTRL_INTFLAG_NSCHK(value)          (NVMCTRL_INTFLAG_NSCHK_Msk & (_UINT8_(value) << NVMCTRL_INTFLAG_NSCHK_Pos)) /* Assigment of value for NSCHK in the NVMCTRL_INTFLAG register */
#define NVMCTRL_INTFLAG_Msk                   _UINT8_(0x3F)                                        /* (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) ( R/ 16) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE             _UINT16_(0x00)                                       /*  (NVMCTRL_STATUS) Status  Reset Value */

#define NVMCTRL_STATUS_PRM_Pos                _UINT16_(0)                                          /* (NVMCTRL_STATUS) Power Reduction Mode Position */
#define NVMCTRL_STATUS_PRM_Msk                (_UINT16_(0x1) << NVMCTRL_STATUS_PRM_Pos)            /* (NVMCTRL_STATUS) Power Reduction Mode Mask */
#define NVMCTRL_STATUS_PRM(value)             (NVMCTRL_STATUS_PRM_Msk & (_UINT16_(value) << NVMCTRL_STATUS_PRM_Pos)) /* Assigment of value for PRM in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_LOAD_Pos               _UINT16_(1)                                          /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Position */
#define NVMCTRL_STATUS_LOAD_Msk               (_UINT16_(0x1) << NVMCTRL_STATUS_LOAD_Pos)           /* (NVMCTRL_STATUS) NVM Page Buffer Active Loading Mask */
#define NVMCTRL_STATUS_LOAD(value)            (NVMCTRL_STATUS_LOAD_Msk & (_UINT16_(value) << NVMCTRL_STATUS_LOAD_Pos)) /* Assigment of value for LOAD in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_READY_Pos              _UINT16_(2)                                          /* (NVMCTRL_STATUS) NVM Ready Position */
#define NVMCTRL_STATUS_READY_Msk              (_UINT16_(0x1) << NVMCTRL_STATUS_READY_Pos)          /* (NVMCTRL_STATUS) NVM Ready Mask */
#define NVMCTRL_STATUS_READY(value)           (NVMCTRL_STATUS_READY_Msk & (_UINT16_(value) << NVMCTRL_STATUS_READY_Pos)) /* Assigment of value for READY in the NVMCTRL_STATUS register */
#define NVMCTRL_STATUS_DALFUSE_Pos            _UINT16_(3)                                          /* (NVMCTRL_STATUS) Debug Access Level Fuse Position */
#define NVMCTRL_STATUS_DALFUSE_Msk            (_UINT16_(0x3) << NVMCTRL_STATUS_DALFUSE_Pos)        /* (NVMCTRL_STATUS) Debug Access Level Fuse Mask */
#define NVMCTRL_STATUS_DALFUSE(value)         (NVMCTRL_STATUS_DALFUSE_Msk & (_UINT16_(value) << NVMCTRL_STATUS_DALFUSE_Pos)) /* Assigment of value for DALFUSE in the NVMCTRL_STATUS register */
#define   NVMCTRL_STATUS_DALFUSE_DAL0_Val     _UINT16_(0x0)                                        /* (NVMCTRL_STATUS) Access to very limited features  */
#define   NVMCTRL_STATUS_DALFUSE_DAL1_Val     _UINT16_(0x1)                                        /* (NVMCTRL_STATUS) Access to all non-secure memory. Can debug non-secure CPU code  */
#define   NVMCTRL_STATUS_DALFUSE_DAL2_Val     _UINT16_(0x2)                                        /* (NVMCTRL_STATUS) Access to all memory. Can debug secure and non-secure CPU code  */
#define NVMCTRL_STATUS_DALFUSE_DAL0           (NVMCTRL_STATUS_DALFUSE_DAL0_Val << NVMCTRL_STATUS_DALFUSE_Pos) /* (NVMCTRL_STATUS) Access to very limited features Position  */
#define NVMCTRL_STATUS_DALFUSE_DAL1           (NVMCTRL_STATUS_DALFUSE_DAL1_Val << NVMCTRL_STATUS_DALFUSE_Pos) /* (NVMCTRL_STATUS) Access to all non-secure memory. Can debug non-secure CPU code Position  */
#define NVMCTRL_STATUS_DALFUSE_DAL2           (NVMCTRL_STATUS_DALFUSE_DAL2_Val << NVMCTRL_STATUS_DALFUSE_Pos) /* (NVMCTRL_STATUS) Access to all memory. Can debug secure and non-secure CPU code Position  */
#define NVMCTRL_STATUS_Msk                    _UINT16_(0x001F)                                     /* (NVMCTRL_STATUS) Register Mask  */


